edp/tldr.org
#+OPTIONS: toc:nil
#+OPTIONS: num:nil
#+LATEX_HEADER: \usepackage{geometry}\geometry{a4paper,left=15mm,right=20mm,top=20mm,bottom=30mm}
#+LATEX_HEADER: \newcommand{\R}{\mathbb{R}} \newcommand{\C}{\mathbb{C}}
#+LATEX_HEADER: \usepackage{extarrows} \usepackage{mathtools} \usepackage[utf8]{inputenc}\usepackage[T2A]{fontenc}
#+LATEX_HEADER: \renewcommand{\phi}{\varphi} \newcommand{\parti}[2]{\frac{\partial #1}{\partial #2}}

* might be useful
  #+begin_export latex  
  \[ \frac{d}{dx} \left (\int_{0}^{x} f(x,y)\,dy \right) = f\big(x,x) + \int_{0}^{x}\frac{\partial}{\partial x} f(x,y) \,dy\]
  
  \medskip
  
  care e obtinuta din formula Leibniz:
  \[ \frac{d}{dx} \left (\int_{a(x)}^{b(x)}f(x,t)\,dt \right) = f\big(x,b(x)\big)\cdot \frac{d}{dx} b(x) - f\big(x,a(x)\big)\cdot \frac{d}{dx} a(x) + \int_{a(x)}^{b(x)}\frac{\partial}{\partial x} f(x,t) \,dt\]

  #+end_export
 - laplace operator (laplacian): \( \Delta = \nabla^2 = \nabla \cdot \nabla = \displaystyle \sum_i \dfrac{\partial^2}{\partial x_i^2} \)
 - field therory shit: (curl=rotor)\\
  \(\operatorname{div}  \, \operatorname{grad} f          \equiv \nabla \cdot  \nabla f \equiv \nabla^2 f\)\\
  \(\operatorname{curl} \, \operatorname{grad} f          \equiv \nabla \times \nabla f = \mathbf 0\)\\
  \(\operatorname{div}  \, \operatorname{curl} \mathbf{A} \equiv \nabla \cdot  (\nabla \times \mathbf{A}) = 0\)\\
  \(\operatorname{curl} \, \operatorname{curl} \mathbf{A} \equiv \nabla \times (\nabla \times \mathbf{A}) = \nabla (\nabla \cdot \mathbf{A}) - \nabla^2 \mathbf{A}\)\\
  \(\nabla^2 (f g) = f \nabla^2 g + 2 \nabla f \cdot \nabla g + g \nabla^2 f\)
 - Gauß-Остроградский:
  \[ \int_\Omega \parti{u}{x_i} = \int_{\partial \Omega}u \cdot \nu_i d \sigma \]
  also:
 \[ \int_\Omega \operatorname{div} F (x) dx = \int_{\partial \Omega} F  \cdot \nu d \sigma \]
 - Green formula:
 \[\int_\Omega (\nabla u \cdot \nabla v  + v \Delta u) dx = \int_{\partial \Omega} v \sum_i \parti{u}{x_i} \nu_i d \sigma \]
 - Green formula 1:
 \[ -\int_\Omega \Delta u v dx = \int_\Omega \nabla u \cdot \nabla v dx - \int_{\partial \Omega} \parti{u}{\nu} v  d \sigma \]
 - Green formula 2:
 \[ \int_\Omega (\Delta u v u\Delta v) dx = \int_{\partial \Omega} \parti{u}{\nu} v - u \parti{v}{\nu}  d \sigma \]
 - convoluție:
  \[ f*g (x) = \int_{\R^d} f(x-y) g(y)dy \]
 - REMEMBER THE NORM FOR THE FOURIER THING:
   \[ u(x) = \sum_k \frac{1}{\|\phi_k\|^2} \int_a^b u(x) \phi_k(x) dx \]
 - Ec dif ordin I
 \[x' = a(t)x + b(t) \quad \quad x = e^{\int a(t)dt} \left( C + \int e^{-\int a(t) dt} b(t) dt \right)\]
** coś, sin stuff:
  - \(e^{ix} = \cos x + i \sin x\)
  - \(\sin (k \pi) = 0\)
  - \(\cos (k \pi) = (-1)^k\)
  - \(\int \sin = - \cos\)
  - \(\int \cos = \sin\)
  - \(\sin' = \cos\)
  - \(\cos' = - \sin\)
  - \(\sin x = \dfrac{e^{ix}-e^{-ix}}{2i}\)
  - \( \cos x = \dfrac{e^{ix}+e^{-ix}}{2}\)
*** product to sum
   - \( 2\cos \theta \cos \varphi = {{\cos(\theta - \varphi) + \cos(\theta + \varphi)}}\)
   - \(2\sin \theta \sin \varphi = {{\cos(\theta - \varphi) - \cos(\theta + \varphi)} }\)
   - \(2\sin \theta \cos \varphi = {{\sin(\theta + \varphi) + \sin(\theta - \varphi)} }\)
   - \(2\cos \theta \sin \varphi = {{\sin(\theta + \varphi) - \sin(\theta - \varphi)} }\)
   - \(\cos^2 \varphi = \frac{1+\cos(2\varphi)}{2} \)
   - \(\sin^2 \varphi = \frac{1-\cos(2\varphi)}{2} \)

*** sum to product
 - \(\sin \theta \pm \sin \varphi = 2 \sin\left( \dfrac{\theta \pm \varphi}{2} \right) \cos\left( \dfrac{\theta \mp \varphi}{2} \right)\)
 - \(\cos \theta + \cos \varphi = 2 \cos\left( \dfrac{\theta + \varphi} {2} \right) \cos\left( \dfrac{\theta - \varphi}{2} \right)\)
 - \(\cos \theta - \cos \varphi = -2\sin\left( \dfrac{\theta + \varphi}{2}\right) \sin\left(\dfrac{\theta - \varphi}{2}\right)\)


* conditions
 - dirichlet: \(u(x) = f(x)\) pe \(\partial \Omega\)
 - newman: \(\parti{u}{\nu}(x) = f(x)\) pe \(\partial \Omega\)
 - robin: \(\parti{u}{\nu}(x) +u(x) = f(x)\) pe \(\partial \Omega\)
* misc
 - proiectie pe subspatii inchise:
 \[ \exists ! Pu \in V  \text{ aî } \| P u - u \|  = \inf_{v \in V} \| v - u \| \]
   - în plus \( (u-Pu)\perp V \) (ie \( \langle u-Pu, v \rangle = 0,~ \forall v \in V \))
 - bessel inequality: \(V = \operatorname{span} \{ v_1,\ldots, v_n \} \)
   \[ \| u\|^2 \geq \|P_V u\|^2 = \sum_{j=1}^n \frac{|\langle u, v_j\rangle|^2}{\|v_j\|^2} \]
 - daca are loc ineg parseval și \(\{f_j\}\) ortongolală, at e bază Hilbertiană
 - scalar product with functions \( f: [a,b] \to \mathbb{C} \in L^2([a, b]) \):
 - weak convergence:
   \[ \langle f, g\rangle = \int_a^b f(x) \overline{g(x)} dx  \]
   \[ u^n \rightharpoonup u \text{ dacă} \langle u^n-u, v\rangle \to 0, \forall v \in H \]

* Sturm-Liouville - S1
** valori proprii
 - c3 - pg 5
 - Melnig thing pg 7

 - do the \(|\cdot \varphi, \int\) to get \(\lambda \geq 0\)
 - if \(\varphi = 0\) we ignore that one. we dont want null solutions

#+begin_export latex
\begin{itemize}
 \item we get the characteristic 
 equation\footnote{\url{https://en.wikipedia.org/wiki/Characteristic_equation_(calculus)}} (polinom caracteristic:
  \[ \varphi''(x) + \lambda \varphi(x) =0  \text{ becomes } r^2 + \lambda\cdot 1 = 0 \]  
\end{itemize}
 #+end_export
 - and we get the functions of form (may differ depending on the characteristic equation):
  \[\left \{ e^{r_i}, \ldots, x^m e^{r_i} \right\} \] 
  or, for our example:
  \[ \sin(\sqrt{\lambda} x), \cos(\sqrt{\lambda} x) \] 
  so 
  \[\varphi(x) = \alpha \sin(\sqrt{\lambda} x) + \beta \cos(\sqrt{\lambda} x) \]
 - with the initial conditions: \( \varphi(0) = \varphi(l) = 0 \)
   we get some restrictions for \(\alpha\) and \(\beta\)
 and, tada, ya get some \(\lambda_k, \varphi_k\)

* Green's function:
 - for n-th order differential equations:
  see green-kurzgesagt
* separation of variables
  - see s6 - pg 2
  - we have:
  #+begin_export latex
  \[
  \begin{cases}
  -\Delta u = f,\quad \text{în }\Omega = (a, b) \times (c, d)\\
  \text{some condition like } u = 0,\quad \text{pe }\partial\Omega
  \end{cases}
  \]
  #+end_export
  - we write stuff with respect to \(x\):
  #+begin_export latex
  \[
  \begin{cases}
  - \phi'' = \lambda \phi,\quad \text{în }\Omega = (a, b)\\
  \text{some condition like } u(a) = u(b) = 0
  \end{cases}
  \]
  #+end_export
  - and we get some eigen functions and values: 
   \(\{\phi_k\}, \(\{\lambda_k\}\)
  - we write things with the new functions:
    \[ u(x, y) = \sum^\infty_k u_k(y) \phi_k(x) \]
    \[ u_{xx} = ..., u_{yy} = ...\]
    \[ f(x, y) = \sum f_k(y) \phi_k(x) = \sum \frac{1}{\| \phi_k\|^2} \left( \int_a^b f(t, y) \phi_k(t) dt \right) \phi_k(x)\]
 - then we solve it for some \(k\)
    #+begin_export latex
    \[
    \begin{cases}
    -\Delta u_k(y) = f_k(y),\quad \text{în }(c, d)\\
    \text{some condition like } u(c) = u(d) = 0
    \end{cases}
    \]
    #+end_export
  and we get
  \[ u_k(y) = \int_c^d G_k(y, s) f_k(s) ds \]
 - sum things together and we get a \(G \big((x, y), (t, s)\big) \):
   \[ u(x, y) = \int_c^d \sum_k G_k(y, s) \frac{1}{\| \phi_k\|^2} \left( \int_a^b f(t, y) \phi_k(t) \, dt \right) \phi_k(x)\, ds \]
  aka
\[ u(x, y) = \int_c^d \int_a^b \left(\sum_k G_k(y, s) \frac{1}{\| \phi_k\|^2}  \phi_k(t) \phi_k(x) \right) f(t, s) \, dt \, ds \]
  and, tada
  \[G \big((x, y), (t, s)\big) = \sum_{k=1}^\infty G_k(y, s) \frac{1}{\| \phi_k\|^2}  \phi_k(t) \phi_k(x) \]

