edp/tldr.tex
% Created 2021-01-27 Mi 21:01
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{minted}
\usepackage{geometry}\geometry{a4paper,left=15mm,right=20mm,top=20mm,bottom=30mm}
\newcommand{\R}{\mathbb{R}} \newcommand{\C}{\mathbb{C}}
\usepackage{extarrows} \usepackage{mathtools} \usepackage[utf8]{inputenc}\usepackage[T2A]{fontenc}
\renewcommand{\phi}{\varphi} \newcommand{\parti}[2]{\frac{\partial #1}{\partial #2}}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.1 (Org mode 9.3)}, 
 pdflang={English}}
\begin{document}



\section*{might be useful}
\label{sec:org2cda3a3}
\[ \frac{d}{dx} \left (\int_{0}^{x} f(x,y)\,dy \right) = f\big(x,x) + \int_{0}^{x}\frac{\partial}{\partial x} f(x,y) \,dy\]

\medskip

care e obtinuta din formula Leibniz:
\[ \frac{d}{dx} \left (\int_{a(x)}^{b(x)}f(x,t)\,dt \right) = f\big(x,b(x)\big)\cdot \frac{d}{dx} b(x) - f\big(x,a(x)\big)\cdot \frac{d}{dx} a(x) + \int_{a(x)}^{b(x)}\frac{\partial}{\partial x} f(x,t) \,dt\]
\begin{itemize}
\item laplace operator (laplacian): \(\Delta = \nabla^2 = \nabla \cdot \nabla = \displaystyle \sum_i \dfrac{\partial^2}{\partial x_i^2}\)
\item field therory shit: (curl=rotor)\\
\(\operatorname{div}  \, \operatorname{grad} f          \equiv \nabla \cdot  \nabla f \equiv \nabla^2 f\)\\
\(\operatorname{curl} \, \operatorname{grad} f          \equiv \nabla \times \nabla f = \mathbf 0\)\\
\(\operatorname{div}  \, \operatorname{curl} \mathbf{A} \equiv \nabla \cdot  (\nabla \times \mathbf{A}) = 0\)\\
\(\operatorname{curl} \, \operatorname{curl} \mathbf{A} \equiv \nabla \times (\nabla \times \mathbf{A}) = \nabla (\nabla \cdot \mathbf{A}) - \nabla^2 \mathbf{A}\)\\
\(\nabla^2 (f g) = f \nabla^2 g + 2 \nabla f \cdot \nabla g + g \nabla^2 f\)
\item Gauß-Остроградский:
\[ \int_\Omega \parti{u}{x_i} = \int_{\partial \Omega}u \cdot \nu_i d \sigma \]
also:
\end{itemize}
\[ \int_\Omega \operatorname{div} F (x) dx = \int_{\partial \Omega} F  \cdot \nu d \sigma \]
\begin{itemize}
\item Green formula:
\end{itemize}
\[\int_\Omega (\nabla u \cdot \nabla v  + v \Delta u) dx = \int_{\partial \Omega} v \sum_i \parti{u}{x_i} \nu_i d \sigma \]
\begin{itemize}
\item Green formula 1:
\end{itemize}
\[ -\int_\Omega \Delta u v dx = \int_\Omega \nabla u \cdot \nabla v dx - \int_{\partial \Omega} \parti{u}{\nu} v  d \sigma \]
\begin{itemize}
\item Green formula 2:
\end{itemize}
\[ \int_\Omega (\Delta u v u\Delta v) dx = \int_{\partial \Omega} \parti{u}{\nu} v - u \parti{v}{\nu}  d \sigma \]
\begin{itemize}
\item convoluție:
\[ f*g (x) = \int_{\R^d} f(x-y) g(y)dy \]
\item REMEMBER THE NORM FOR THE FOURIER THING:
\[ u(x) = \sum_k \frac{1}{\|\phi_k\|^2} \int_a^b u(x) \phi_k(x) dx \]
\item fourier desmos: \url{https://www.desmos.com/calculator/xkc2e0emnm}

\item Ec dif ordin I
\end{itemize}
\[x' = a(t)x + b(t) \quad \quad x = e^{\int a(t)dt} \left( C + \int e^{-\int a(t) dt} b(t) dt \right)\]
\subsection*{coś, sin stuff:}
\label{sec:orgb80c288}
\begin{itemize}
\item \(e^{ix} = \cos x + i \sin x\)
\item \(\sin (k \pi) = 0\)
\item \(\cos (k \pi) = (-1)^k\)
\item \(\int \sin = - \cos\)
\item \(\int \cos = \sin\)
\item \(\sin' = \cos\)
\item \(\cos' = - \sin\)
\item \(\sin x = \dfrac{e^{ix}-e^{-ix}}{2i}\)
\item \(\cos x = \dfrac{e^{ix}+e^{-ix}}{2}\)
\end{itemize}
\subsubsection*{product to sum}
\label{sec:org44079ad}
\begin{itemize}
\item \(2\cos \theta \cos \varphi = {{\cos(\theta - \varphi) + \cos(\theta + \varphi)}}\)
\item \(2\sin \theta \sin \varphi = {{\cos(\theta - \varphi) - \cos(\theta + \varphi)} }\)
\item \(2\sin \theta \cos \varphi = {{\sin(\theta + \varphi) + \sin(\theta - \varphi)} }\)
\item \(2\cos \theta \sin \varphi = {{\sin(\theta + \varphi) - \sin(\theta - \varphi)} }\)
\item \(\cos^2 \varphi = \frac{1+\cos(2\varphi)}{2}\)
\item \(\sin^2 \varphi = \frac{1-\cos(2\varphi)}{2}\)
\end{itemize}

\subsubsection*{sum to product}
\label{sec:orgc83b924}
\begin{itemize}
\item \(\sin \theta \pm \sin \varphi = 2 \sin\left( \dfrac{\theta \pm \varphi}{2} \right) \cos\left( \dfrac{\theta \mp \varphi}{2} \right)\)
\item \(\cos \theta + \cos \varphi = 2 \cos\left( \dfrac{\theta + \varphi} {2} \right) \cos\left( \dfrac{\theta - \varphi}{2} \right)\)
\item \(\cos \theta - \cos \varphi = -2\sin\left( \dfrac{\theta + \varphi}{2}\right) \sin\left(\dfrac{\theta - \varphi}{2}\right)\)
\end{itemize}


\section*{conditions}
\label{sec:org2f5f0d7}
\begin{itemize}
\item dirichlet: \(u(x) = f(x)\) pe \(\partial \Omega\)
\item newman: \(\parti{u}{\nu}(x) = f(x)\) pe \(\partial \Omega\)
\item robin: \(\parti{u}{\nu}(x) +u(x) = f(x)\) pe \(\partial \Omega\)
\end{itemize}
\section*{misc}
\label{sec:orgceab0b8}
\begin{itemize}
\item proiectie pe subspatii inchise:
\end{itemize}
\[ \exists ! Pu \in V  \text{ aî } \| P u - u \|  = \inf_{v \in V} \| v - u \| \]
\begin{itemize}
\item în plus \((u-Pu)\perp V\) (ie \(\langle u-Pu, v \rangle = 0,~ \forall v \in V\))
\end{itemize}
\begin{itemize}
\item bessel inequality: \(V = \operatorname{span} \{ v_1,\ldots, v_n \}\)
\[ \| u\|^2 \geq \|P_V u\|^2 = \sum_{j=1}^n \frac{|\langle u, v_j\rangle|^2}{\|v_j\|^2} \]
\item daca are loc ineg parseval și \(\{f_j\}\) ortongolală, at e bază Hilbertiană
\item scalar product with functions \(f: [a,b] \to \mathbb{C} \in L^2([a, b])\):
\item weak convergence:
\[ \langle f, g\rangle = \int_a^b f(x) \overline{g(x)} dx  \]
\[ u^n \rightharpoonup u \text{ dacă} \langle u^n-u, v\rangle \to 0, \forall v \in H \]
\end{itemize}

\section*{Sturm-Liouville - S1}
\label{sec:org2b4f4eb}
\subsection*{valori proprii}
\label{sec:org9db0e4b}
\begin{itemize}
\item c3 - pg 5
\item Melnig thing pg 7

\item do the \(|\cdot \varphi, \int\) to get \(\lambda \geq 0\)
\item if \(\varphi = 0\) we ignore that one. we dont want null solutions
\end{itemize}

\begin{itemize}
 \item we get the characteristic 
 equation\footnote{\url{https://en.wikipedia.org/wiki/Characteristic_equation_(calculus)}} (polinom caracteristic:
  \[ \varphi''(x) + \lambda \varphi(x) =0  \text{ becomes } r^2 + \lambda\cdot 1 = 0 \]  
\end{itemize}
\begin{itemize}
\item and we get the functions of form (may differ depending on the characteristic equation):
\[\left \{ e^{r_i}, \ldots, x^m e^{r_i} \right\} \] 
or, for our example:
\[ \sin(\sqrt{\lambda} x), \cos(\sqrt{\lambda} x) \] 
so 
\[\varphi(x) = \alpha \sin(\sqrt{\lambda} x) + \beta \cos(\sqrt{\lambda} x) \]
\item with the initial conditions: \(\varphi(0) = \varphi(l) = 0\)
we get some restrictions for \(\alpha\) and \(\beta\)
\end{itemize}
and, tada, ya get some \(\lambda_k, \varphi_k\)

\section*{Green's function:}
\label{sec:org422db96}
\begin{itemize}
\item for n-th order differential equations:
see green-kurzgesagt
\end{itemize}
\section*{separation of variables}
\label{sec:orgea0b630}
\begin{itemize}
\item see s6 - pg 2
\item we have:
\end{itemize}
\[
\begin{cases}
-\Delta u = f,\quad \text{în }\Omega = (a, b) \times (c, d)\\
\text{some condition like } u = 0,\quad \text{pe }\partial\Omega
\end{cases}
\]
\begin{itemize}
\item we write stuff with respect to \(x\):
\end{itemize}
\[
\begin{cases}
- \phi'' = \lambda \phi,\quad \text{în }\Omega = (a, b)\\
\text{some condition like } u(a) = u(b) = 0
\end{cases}
\]
\begin{itemize}
\item and we get some eigen functions and values: 
\(\{\phi_k\}\), \(\{\lambda_k\}\)
\item we write things with the new functions:
\[ u(x, y) = \sum^\infty_k u_k(y) \phi_k(x) \]
\[ u_{xx} = ..., u_{yy} = ...\]
\[ f(x, y) = \sum f_k(y) \phi_k(x) = \sum \frac{1}{\| \phi_k\|^2} \left( \int_a^b f(t, y) \phi_k(t) dt \right) \phi_k(x)\]
\end{itemize}
\begin{itemize}
\item then we solve it for some \(k\)
\[
\begin{cases}
-\Delta u_k(y) = f_k(y),\quad \text{în }(c, d)\\
\text{some condition like } u(c) = u(d) = 0
\end{cases}
\]
and we get
\[ u_k(y) = \int_c^d G_k(y, s) f_k(s) ds \]
\item sum things together and we get a \(G \big((x, y), (t, s)\big)\):
 \[ u(x, y) = \int_c^d \sum_k G_k(y, s) \frac{1}{\| \phi_k\|^2} \left( \int_a^b f(t, y) \phi_k(t) \, dt \right) \phi_k(x)\, ds \]
aka
\end{itemize}
\[ u(x, y) = \int_c^d \int_a^b \left(\sum_k G_k(y, s) \frac{1}{\| \phi_k\|^2}  \phi_k(t) \phi_k(x) \right) f(t, s) \, dt \, ds \]
  and, tada
  \[G \big((x, y), (t, s)\big) = \sum_{k=1}^\infty G_k(y, s) \frac{1}{\| \phi_k\|^2}  \phi_k(t) \phi_k(x) \]
