edp/tldr.org
** eigen values for op laplace
   - s7 pg 6
   - tl;dr we split it in 2 and get sum the eigenvalues

* max principle and stuff
 - \(\Delta\) = op laplace
 - \(\Delta u = 0 \) means \(u\) armonică
 - \(\Delta u \geq 0 \) means \(u\) subarmonică
 - \(\Delta u \leq 0 \) means \(u\) super-armonică
** The actual thing
 - s9 pg 3
 Dacă \( C^2(\Omega) \cap C(\bar{\Omega})\) și \( \Delta \geq 0 \text{ în } \Omega \)  at:\\
 \( \sup\limits_{\bar{\Omega}} u = \sup\limits_{\partial \Omega} u \)\\
 și dacă \(\exists \bar{x} \in \Omega \) aî \(u(\bar{x}) = \sup\limits_{\bar{\Omega}} u \) at \(u \equiv \) const
** unicitatea sol dirichlet
 - s9 pg 4
 - übermelnig 109
 - tl;dr if we have
    #+begin_export latex
    \[ 
    \begin{cases}
    \Delta u = f, & \text{ în } \Omega \subseteq \R^d\\
    u = f, & \text{ pe } \partial \Omega
    \end{cases}
    \]
    #+end_export
  we give \(v = u_1 - u_2\)
 #+begin_export latex
 \[ 
 \begin{cases}
    \Delta v = 0, & \text{ în } \Omega \subseteq \R^d\\
    v = 0, & \text{ pe } \partial \Omega
    \end{cases}
    \]
 #+end_export
 and by the "max principle" we have: \( \sup\limits_\Omega v \leq 0\)
 we switch \(u_1 \) and \(u_2\) and we get \(v = 0\) ie \(u_1 = u_2\)
 
** strong max principle (aka pp Hopf)
   Dacă \(\bar{x} \in \partial \Omega \) și \(u(\bar{x}) = M \) at:\\
   \(\displaystyle \parti{u}{\nu} (\bar{x}) >0 \)\\
   sau \(\displaystyle \parti{u}{\nu} (\bar{x}) = 0 \) și \(u \equiv M \) în \Omega   
* variational principle
  - Fundamental sol for laplace:
    #+begin_export latex
    \[
    E(x) = \begin{dcases}
    \frac{1}{2\pi} \ln|x|, & d=2\\
    -\frac{1}{(d-2)\omega_d|x|^{d-2}},& d> 2
    \end{dcases}
    \]
    #+end_export
   unde (aka aria bilei unitate):
   \[\omega_d = \mu_{d-1}(\partial B_1) = \int_{\partial B_1}  1 d \sigma \]
 - btw: \( E(x) = E(|x|)\)
 - Riemann-green: (c8)
   #+begin_export latex
   \[
   \int_\Omega E(x-y) \Delta u(y) dy - \int_\Omega E(x-y) \parti{u}{\nu_y}(y) d\sigma_y +
   \int_{\partial\Omega}  \parti{}{\nu_y}E(x-y) u(y) d\sigma_y =
   \begin{cases}
   u(x), & x \in \Omega,\\
   \frac{1}{2} u(x), & x \in \partial\Omega,\\
   0, & x \in \R^d \setminus \bar{\Omega}
   \end{cases}
   \]
   #+end_export
** actual solving - übermelnig - pg 115,117,118, 121,122:
 - Sol variationala e sol clasica
 având:
 #+begin_export latex
 \[
\begin{cases}
 - \delta u = f, &\Omega,\\
 u= g_1, & \Gamma_1,\\
 \parti{u}{\nu}= g_2, & \Gamma_2,\\
 \parti{u}{\nu}+u= g_3, & \Gamma_3\\
\end{cases}
 \]
 #+end_export
 definim
 \[V = \left\{v \in C^1_p(\Omega) \mid v=0 \text{ pe } \partial \Omega \right\}\]
 calcul formal (via Green formula 1; it's exacly this), \(u\in C^2(\Omega)\):
 \[-\int_\Omega \Delta u v\, d\mu = \int_\Omega \nabla u\nabla v\,d\mu-
 \int_{\partial\Omega} \parti{u}{\nu} v\,d\sigma\]
 
 then we write:
 \[
 \int_{\partial\Omega} \parti{u}{\nu} v\,d\sigma =
 \int_{\Gamma_1} \parti{u}{\nu} v\,d\sigma + 
 \int_{\Gamma_2} \parti{u}{\nu} v\,d\sigma + 
 \int_{\Gamma_3} \parti{u}{\nu} v\,d\sigma
\]
\[
 \int_{\partial\Omega} \parti{u}{\nu} v\,d\sigma =
 \int_{\Gamma_1} \parti{u}{\nu} v\,d\sigma + 
 \int_{\Gamma_2} g_1 v\,d\sigma + 
 \int_{\Gamma_3} (g_3-u) v\,d\sigma
\]
split it into\\
\(a(u, v)\) -simetrica, biliniara, and \( \ell (v) \), liniara, cont

for unicitate \(w=u_1-u_2\), \(v = w\) and we get \( a(w, w) = 0\)

 sigh, see the pages mentioned above
* fourier transform:
 - def: \[\hat{f}(\lambda) = \frac{1}{2\pi} \int_{-\infty}^{\infty} f(x)\ e^{- i \lambda x}\,dx\]
 - see https://en.wikipedia.org/wiki/Fourier_transform#Functional_relationships,_one-dimensional
 - \(\hat{u}^{(k)}(\lambda) = \widehat{[(-ix)^k u(x) ]} (\lambda) \)
 - \(\widehat{u^{(k)}}(\lambda) = (2\pi{}i \lambda)^k \hat{u}(\lambda) \)
 - \(\widehat{u*v}(\lambda) = \hat{u}(\lambda)\hat{v}(\lambda)\)
 - \(\widehat{u\cdot v}(\lambda) = \hat{u}(\lambda)*\hat{v}(\lambda)\)
 - \(\widehat{u_x}(\lambda) = i \lambda \hat{u}(\lambda)\)
 - \(\widehat{u_{xx}}(\lambda) = - \lambda^2 \hat{u}(\lambda)\)
 - \(\widehat{u_t}(\lambda) = \parti{}{t} \hat{u}(\lambda)\)
 - \(\widehat{u_{tt}}(\lambda) = \parti{^2}{t^2} \hat{u}(\lambda)\)
 - \(\widehat{u(x-a)}(\lambda) = e^{-ia \lambda} \hat{u} (\lambda) \)
 - \(\widehat{\hat{u}(x)}(\lambda) = \hat{u} (-\lambda) \)
 - \(\widehat{\hat{u}(ax)}(\lambda) = \frac{1}{|a|} \hat{u}\left (\frac{\lambda}{a}\right) \)
 
* toc
** course
 - C1: basic shit
 - C2: 
   - basic shit (prod scalar and norm)
   - projections
   - besel inequality
 - C3:
   - more besel
   - hilbert basis
   - problem with Green's function
   - hilbert spaces examples
 - C4:
   - proprietati Green's thing - pg 2
   - Riesz  representation theorem - pg 5 (dual stuff)
   - autoadjunct daca \(T = T^*\)
 - C5:
   - weak convergence
   - hilbert basis proprierties & stuff
 - C6: 
   - more weird abstract shit
   - sturm liouville in general form - pg 11
 - C7:
   - differential subvariety stuff 
   - green's formulas
   - convolutions
   - that weird fundam\(E\)ntal thing
 - C8:
   - unicitate, existenta, repr integrala, dependenta de datele pb, approx numerica
   - fundamental solution for \(\Delta\) - op laplace
   - riemann-green
 - C9:
   - riemann green again
   - unicitate, existenta, repr integrala, dependenta de datele pb, approx numerica, but actually done
 - c10
   - pp maxim general
   - sol variationale, finally pg 8
 - s11
** seminaries
*** S1
 - tl;dr normal differential equations
 #+begin_export latex
 \[
 \begin{cases}
 u'_k(t) + \lambda_k u_k(t) = f_k(t), t>0\\
 u_k(0) = u_k^0
 \end{cases}
 \]\[
 u_k(t) = e^{-\lambda_kt} u_k^0 + \int_0^t \exp(-\lambda_k(t-s)) f_k(s)ds
 \]
 #+end_export
 - sturm-liouville stuff
*** S2, s3
 - sturm-liouville and fourier exercises
*** s4:
 - met sep variabilelor pg 4
 - fundamental solution pg 10
*** s5
 - green shit
*** s6, s7
 - separation of variabiles for sturm-liouvile problems + green - pg 3 
*** s7
  - solving eigen-value problems for \(\Delta\)
*** s8
  - recapitulare
*** s9, s10, s11
 - pp de maxim +aplicatii
*** s11
 - that weird fundam\(E\)ntal thing pg 11
*** s12
 - variational thing
** that old book
 - green - pg 39
** melnig thing
 - 7 - val proprii
 - 15 - parseval stuff

** über-melnig thing - maed bai benni
Most of the stuff are seen in the melnig seminaries:

Par example
*** Ex 1: Sturm- Liouville: page 6 - 14
Replace a with smth else ofc.

\smallskip
*** Ex2: Ar ca ... ortogonale   page 4 -  6
    
    
    
    Also Id Parseval + Dezv in serii Fourier: page 15 - 30
\smallskip

*** Ex3: Metoda separarii variabilelor: mostly from page 42 to -  102

Furthermore, there is the list on which to calculate...

Most seen stuff: metoda separarii, pb parabolica: page 32


An example : page 36


Pb hiperbolica: page 47 and 86

Also check Sem9, page 80

*** Ex: 4 problema eliptica la limita: page 91,

Principiul de maxim: page 103

Formularea variationala pt elipsa: page 115, also s13-14 first pages

*** Ex 6: transformata fourier: check s14, page 13

