edp/tldr.tex

\subsection*{eigen values for op laplace}
\label{sec:org37d1342}
\begin{itemize}
\item s7 pg 6
\item tl;dr we split it in 2 and get sum the eigenvalues
\end{itemize}

\section*{max principle and stuff}
\label{sec:org52461f7}
\begin{itemize}
\item \(\Delta\) = op laplace
\item \(\Delta u = 0\) means \(u\) armonică
\item \(\Delta u \geq 0\) means \(u\) subarmonică
\item \(\Delta u \leq 0\) means \(u\) super-armonică
\end{itemize}
\subsection*{The actual thing}
\label{sec:org5d06f89}
\begin{itemize}
\item s9 pg 3
\end{itemize}
Dacă \(C^2(\Omega) \cap C(\bar{\Omega})\) și \(\Delta \geq 0 \text{ în } \Omega\)  at:\\
\(\sup\limits_{\bar{\Omega}} u = \sup\limits_{\partial \Omega} u\)\\
și dacă \(\exists \bar{x} \in \Omega\) aî \(u(\bar{x}) = \sup\limits_{\bar{\Omega}} u\) at \(u \equiv\) const
\subsection*{unicitatea sol dirichlet}
\label{sec:orgcc3b1c1}
\begin{itemize}
\item s9 pg 4
\item übermelnig 109
\item tl;dr if we have
\[ 
\begin{cases}
\Delta u = f, & \text{ în } \Omega \subseteq \R^d\\
u = f, & \text{ pe } \partial \Omega
\end{cases}
\]
we give \(v = u_1 - u_2\)
\end{itemize}
\[ 
\begin{cases}
   \Delta v = 0, & \text{ în } \Omega \subseteq \R^d\\
   v = 0, & \text{ pe } \partial \Omega
   \end{cases}
   \]
and by the "max principle" we have: \(\sup\limits_\Omega v \leq 0\)
we switch \(u_1\) and \(u_2\) and we get \(v = 0\) ie \(u_1 = u_2\)

\subsection*{strong max principle (aka pp Hopf)}
\label{sec:org1dd6075}
Dacă \(\bar{x} \in \partial \Omega\) și \(u(\bar{x}) = M\) at:\\
\(\displaystyle \parti{u}{\nu} (\bar{x}) >0\)\\
sau \(\displaystyle \parti{u}{\nu} (\bar{x}) = 0\) și \(u \equiv M\) în \(\Omega\)   
\section*{variational principle}
\label{sec:org2fed501}
\begin{itemize}
\item Fundamental sol for laplace:
\[
E(x) = \begin{dcases}
\frac{1}{2\pi} \ln|x|, & d=2\\
-\frac{1}{(d-2)\omega_d|x|^{d-2}},& d> 2
\end{dcases}
\]
unde (aka aria bilei unitate):
\[\omega_d = \mu_{d-1}(\partial B_1) = \int_{\partial B_1}  1 d \sigma \]
\end{itemize}
\begin{itemize}
\item btw: \(E(x) = E(|x|)\)
\item Riemann-green: (c8)
\[
\int_\Omega E(x-y) \Delta u(y) dy - \int_\Omega E(x-y) \parti{u}{\nu_y}(y) d\sigma_y +
\int_{\partial\Omega}  \parti{}{\nu_y}E(x-y) u(y) d\sigma_y =
\begin{cases}
u(x), & x \in \Omega,\\
\frac{1}{2} u(x), & x \in \partial\Omega,\\
0, & x \in \R^d \setminus \bar{\Omega}
\end{cases}
\]
\end{itemize}
\subsection*{actual solving - übermelnig - pg 115,117,118, 121,122:}
\label{sec:org939fa45}
\begin{itemize}
\item Sol variationala e sol clasica
\end{itemize}
având:
 \[
\begin{cases}
 - \delta u = f, &\Omega,\\
 u= g_1, & \Gamma_1,\\
 \parti{u}{\nu}= g_2, & \Gamma_2,\\
 \parti{u}{\nu}+u= g_3, & \Gamma_3\\
\end{cases}
 \]
definim
\[V = \left\{v \in C^1_p(\Omega) \mid v=0 \text{ pe } \partial \Omega \right\}\]
calcul formal (via Green formula 1; it's exacly this), \(u\in C^2(\Omega)\):
\[-\int_\Omega \Delta u v\, d\mu = \int_\Omega \nabla u\nabla v\,d\mu-
 \int_{\partial\Omega} \parti{u}{\nu} v\,d\sigma\]

 then we write:
 \[
 \int_{\partial\Omega} \parti{u}{\nu} v\,d\sigma =
 \int_{\Gamma_1} \parti{u}{\nu} v\,d\sigma + 
 \int_{\Gamma_2} \parti{u}{\nu} v\,d\sigma + 
 \int_{\Gamma_3} \parti{u}{\nu} v\,d\sigma
\]
\[
 \int_{\partial\Omega} \parti{u}{\nu} v\,d\sigma =
 \int_{\Gamma_1} \parti{u}{\nu} v\,d\sigma + 
 \int_{\Gamma_2} g_1 v\,d\sigma + 
 \int_{\Gamma_3} (g_3-u) v\,d\sigma
\]
split it into\\
\(a(u, v)\) -simetrica, biliniara, and \(\ell (v)\), liniara, cont

for unicitate \(w=u_1-u_2\), \(v = w\) and we get \(a(w, w) = 0\)

sigh, see the pages mentioned above
\section*{fourier transform:}
\label{sec:org7c17071}
\begin{itemize}
\item def: \[\hat{f}(\lambda) = \frac{1}{2\pi} \int_{-\infty}^{\infty} f(x)\ e^{- i \lambda x}\,dx\]
\item see \url{https://en.wikipedia.org/wiki/Fourier\_transform\#Functional\_relationships,\_one-dimensional}
\item \(\hat{u}^{(k)}(\lambda) = \widehat{[(-ix)^k u(x) ]} (\lambda)\)
\item \(\widehat{u^{(k)}}(\lambda) = (2\pi{}i \lambda)^k \hat{u}(\lambda)\)
\item \(\widehat{u*v}(\lambda) = \hat{u}(\lambda)\hat{v}(\lambda)\)
\item \(\widehat{u\cdot v}(\lambda) = \hat{u}(\lambda)*\hat{v}(\lambda)\)
\item \(\widehat{u_x}(\lambda) = i \lambda \hat{u}(\lambda)\)
\item \(\widehat{u_{xx}}(\lambda) = - \lambda^2 \hat{u}(\lambda)\)
\item \(\widehat{u_t}(\lambda) = \parti{}{t} \hat{u}(\lambda)\)
\item \(\widehat{u_{tt}}(\lambda) = \parti{^2}{t^2} \hat{u}(\lambda)\)
\item \(\widehat{u(x-a)}(\lambda) = e^{-ia \lambda} \hat{u} (\lambda)\)
\item \(\widehat{\hat{u}(x)}(\lambda) = \hat{u} (-\lambda)\)
\item \(\widehat{\hat{u}(ax)}(\lambda) = \frac{1}{|a|} \hat{u}\left (\frac{\lambda}{a}\right)\)
\end{itemize}

\section*{toc}
\label{sec:org7163f9e}
\subsection*{course}
\label{sec:org98f85f9}
\begin{itemize}
\item C1: basic shit
\item C2: 
\begin{itemize}
\item basic shit (prod scalar and norm)
\item projections
\item besel inequality
\end{itemize}
\item C3:
\begin{itemize}
\item more besel
\item hilbert basis
\item problem with Green's function
\item hilbert spaces examples
\end{itemize}
\item C4:
\begin{itemize}
\item proprietati Green's thing - pg 2
\item Riesz  representation theorem - pg 5 (dual stuff)
\item autoadjunct daca \(T = T^*\)
\end{itemize}
\item C5:
\begin{itemize}
\item weak convergence
\item hilbert basis proprierties \& stuff
\end{itemize}
\item C6: 
\begin{itemize}
\item more weird abstract shit
\item sturm liouville in general form - pg 11
\end{itemize}
\item C7:
\begin{itemize}
\item differential subvariety stuff
\item green's formulas
\item convolutions
\item that weird fundam\(E\)ntal thing
\end{itemize}
\item C8:
\begin{itemize}
\item unicitate, existenta, repr integrala, dependenta de datele pb, approx numerica
\item fundamental solution for \(\Delta\) - op laplace
\item riemann-green
\end{itemize}
\item C9:
\begin{itemize}
\item riemann green again
\item unicitate, existenta, repr integrala, dependenta de datele pb, approx numerica, but actually done
\end{itemize}
\item c10
\begin{itemize}
\item pp maxim general
\item sol variationale, finally pg 8
\end{itemize}
\item s11
\end{itemize}
\subsection*{seminaries}
\label{sec:org7bbca87}
\subsubsection*{S1}
\label{sec:org247a760}
\begin{itemize}
\item tl;dr normal differential equations
\end{itemize}
\[
\begin{cases}
u'_k(t) + \lambda_k u_k(t) = f_k(t), t>0\\
u_k(0) = u_k^0
\end{cases}
\]\[
u_k(t) = e^{-\lambda_kt} u_k^0 + \int_0^t \exp(-\lambda_k(t-s)) f_k(s)ds
\]
\begin{itemize}
\item sturm-liouville stuff
\end{itemize}
\subsubsection*{S2, s3}
\label{sec:org38ec610}
\begin{itemize}
\item sturm-liouville and fourier exercises
\end{itemize}
\subsubsection*{s4:}
\label{sec:orga7e986a}
\begin{itemize}
\item met sep variabilelor pg 4
\item fundamental solution pg 10
\end{itemize}
\subsubsection*{s5}
\label{sec:org0972666}
\begin{itemize}
\item green shit
\end{itemize}
\subsubsection*{s6, s7}
\label{sec:org725da9f}
\begin{itemize}
\item separation of variabiles for sturm-liouvile problems + green - pg 3
\end{itemize}
\subsubsection*{s7}
\label{sec:org2de8fbf}
\begin{itemize}
\item solving eigen-value problems for \(\Delta\)
\end{itemize}
\subsubsection*{s8}
\label{sec:orgfd2fd63}
\begin{itemize}
\item recapitulare
\end{itemize}
\subsubsection*{s9, s10, s11}
\label{sec:org55e095d}
\begin{itemize}
\item pp de maxim +aplicatii
\end{itemize}
\subsubsection*{s11}
\label{sec:orgd787a1f}
\begin{itemize}
\item that weird fundam\(E\)ntal thing pg 11
\end{itemize}
\subsubsection*{s12}
\label{sec:orgb774d2d}
\begin{itemize}
\item variational thing
\end{itemize}
\subsection*{that old book}
\label{sec:org0d61f66}
\begin{itemize}
\item green - pg 39
\end{itemize}
\subsection*{melnig thing}
\label{sec:org3562d2e}
\begin{itemize}
\item 7 - val proprii
\item 15 - parseval stuff
\end{itemize}

\subsection*{über-melnig thing - maed bai benni}
\label{sec:org477c09e}
Most of the stuff are seen in the melnig seminaries:

Par example
\subsubsection*{Ex 1: Sturm- Liouville: page 6 - 14}
\label{sec:org5c3efe5}
Replace a with smth else ofc.

\smallskip
\subsubsection*{Ex2: Ar ca \ldots{} ortogonale   page 4 -  6}
\label{sec:org799a12c}



Also Id Parseval + Dezv in serii Fourier: page 15 - 30
\smallskip

\subsubsection*{Ex3: Metoda separarii variabilelor: mostly from page 42 to -  102}
\label{sec:orgd84226f}

Furthermore, there is the list on which to calculate\ldots{}

Most seen stuff: metoda separarii, pb parabolica: page 32


An example : page 36


Pb hiperbolica: page 47 and 86

Also check Sem9, page 80

\subsubsection*{Ex: 4 problema eliptica la limita: page 91,}
\label{sec:org2cecd06}

Principiul de maxim: page 103

Formularea variationala pt elipsa: page 115, also s13-14 first pages

\subsubsection*{ex 5: page 115}
\label{sec:orgc150b55}
\subsubsection*{Ex 6: transformata fourier: check s14, page 13}
\label{sec:orgd22a09f}
