edp/tldr.org
* things to know
 - sp Hilbert, serii Fourier, pb Sturm-Liouville
 - separarea variabilelor (pb val proprii, hip, parab, eliptice - serii fourier
 - fct Green (op laplace+ sturm liouville)
 - pp maxim (op eliptici + aplicatii - unicitatea sol si estimari)
 - formularea variationala a pb eliptice (si parab si hip) => sep variabilelor
 - transformata fourier - calcul + cateva proprietati

 - oral: he asks bout some theory bit

