edp/tldr.tex

\section*{things to know}
\label{sec:org76267a3}
\begin{itemize}
\item sp Hilbert, serii Fourier, pb Sturm-Liouville
\item separarea variabilelor (pb val proprii, hip, parab, eliptice - serii fourier
\item fct Green (op laplace+ sturm liouville)
\item pp maxim (op eliptici + aplicatii - unicitatea sol si estimari)
\item formularea variationala a pb eliptice (si parab si hip) => sep variabilelor
\item transformata fourier - calcul + cateva proprietati

\item oral: he asks bout some theory bit
\end{itemize}
\end{document}
